# ElementIdParameterValue Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementIdParameterValue Members
ElementIdParameterValue Class Constructors Methods Properties See Also
---
The ElementIdParameterValue type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementIdParameterValue()()()() | Default constructor |
| ElementIdParameterValue(ElementId) | Value constructor |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Copy | Makes an identical copy of the given parameter value.  (Inherited from ParameterValue.) |
| Dispose | (Inherited from ParameterValue.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Tests equality with another instance of the same class.  (Inherited from ParameterValue.) |
| IsSameType | Tests another instance is of the same value type.  (Inherited from ParameterValue.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ParameterValue.) |
| Value | The stored value |

# See Also
ElementIdParameterValue Class
Autodesk.Revit.DB Namespace